# 练习1-开始了解你的数据

数据来源于[DATA8](https://github.com/justmarkham/DAT8)

### 步骤1 导入必要的库

In [1]:
import numpy as np
import pandas as pd

### 步骤2 从[网址](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user)导入数据集

In [2]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

### 步骤3 将数据集存入一个名为chipo的变量中, 并使用`user_id`作为索引

In [3]:
user = pd.read_csv(url, sep='|', index_col='user_id')

### 步骤4 查看前25行内容

In [4]:
user.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### 步骤5 查看后10个条目

In [5]:
user.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### 步骤6 数据集中有多少个观察值

In [6]:
user.shape[0]

943

In [7]:
#Or
user.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
age           943 non-null int64
gender        943 non-null object
occupation    943 non-null object
zip_code      943 non-null object
dtypes: int64(1), object(3)
memory usage: 76.8+ KB

### 步骤7 数据集中有多少个列

In [8]:
user.shape[1]

4

### 步骤8 打印出全部的列名称

In [9]:
user.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### 步骤9 数据集的索引是怎样的

In [10]:
user.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

### 步骤10 每一列的数据类型是什么

In [13]:
user.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### 步骤11 打印出occupation列

In [16]:
user['occupation'].head()
#Or user.occupation

user_id
1    technician
2         other
3        writer
4    technician
5         other
Name: occupation, dtype: object

### 步骤12 数据集中共统计了多少职业类型

In [21]:
len(user.occupation.unique())

21

### 步骤13 数据集中那种职业出现次数最多

In [23]:
user.occupation.value_counts().head(1)

student    196
Name: occupation, dtype: int64

### 步骤14 对数据集进行总结

In [24]:
user.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### 步骤15 对所有列进行总结

In [25]:
user.describe(include="all")

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### 步骤16 只总结occupation列

In [26]:
user.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### 步骤17 所有user的平均年龄是多少？

In [27]:
user.age.mean()

34.051961823966067

### 步骤18 出现次数最少的年龄是多少岁

In [29]:
#7 years, only 1 occurrence
user.age.value_counts().tail(1)

7    1
Name: age, dtype: int64